---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.ArrayFailures.RadiusTooSmall
source: html/3839549c-1e06-5a89-b2b8-4c0e4d919d5f.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ArrayFailures.RadiusTooSmall Property

Radius is too small.

## Syntax (C#)
```csharp
public static FailureDefinitionId RadiusTooSmall { get; }
```